wosayttn/Gerrit_NuMicro/M2003xC_M2003xD_M2003xE_M2003xG_Series/Library/Device/Nuvoton/M2003/Include/pdma_reg.h
} DSCT_T;

typedef struct
{


/**
 * @var PDMA_T::CURSCAT
 * Offset: 0x100  Current Scatter-gather Descriptor Table Address of PDMA Channel n
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |CURADDR   |PDMA Current Description Address (Read Only)
 * |        |          |This field indicates a 32-bit current external description address of PDMA controller.
 * |        |          |Note: This field is read only and used for Scatter-Gather mode only to indicate the current external description address.
 * @var PDMA_T::CHCTL
 * Offset: 0x400  PDMA Channel Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |CHENn     |PDMA Channel Enable Bits
 * |        |          |Set this bit to 1 to enable PDMAn operation. Channel cannot be active if it is not set as enabled.
 * |        |          |0 = PDMA channel [n] Disabled.
 * |        |          |1 = PDMA channel [n] Enabled.
 * |        |          |Note: Setting the corresponding bit of PDMA_PAUSE or PDMA_CHRST register will also clear this bit.
 * @var PDMA_T::PAUSE
 * Offset: 0x404  PDMA Transfer Pause Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |PAUSEn    |PDMA Channel n Transfer Pause Control (Write Only)
 * |        |          |User can set PAUSEn bit field to pause the PDMA transfer
 * |        |          |When user sets PAUSEn bit, the PDMA controller will pause the on-going transfer, then clear the channel enable bit CHEN(PDMA_CHCTL [n], n=0,1..3) and clear request active flag(PDMA_TRGSTS[n:0], n=0,1..3
 * |        |          |If the paused channel is re-enabled again, the remaining transfers will be processed.
 * |        |          |0 = No effect.
 * |        |          |1 = Pause PDMA channel n transfer.
 * @var PDMA_T::SWREQ
 * Offset: 0x408  PDMA Software Request Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |SWREQn    |PDMA Software Request (Write Only)
 * |        |          |Set this bit to 1 to generate a software request to PDMA [n].
 * |        |          |0 = No effect.
 * |        |          |1 = Generate a software request.
 * |        |          |Note 1: User can read PDMA_TRGSTS register to know which channel is on active
 * |        |          |Active flag may be triggered by software request or peripheral request.
 * |        |          |Note 2: If user does not enable corresponding PDMA channel, the software request will be ignored.
 * @var PDMA_T::TRGSTS
 * Offset: 0x40C  PDMA Channel Request Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |REQSTSn   |PDMA Channel Request Status (Read Only)
 * |        |          |This flag indicates whether channel[n] have a request or not, no matter request from software or peripheral
 * |        |          |When PDMA controller finishes channel transfer, this bit will be cleared automatically.
 * |        |          |0 = PDMA Channel n has no request.
 * |        |          |1 = PDMA Channel n has a request.
 * |        |          |Note: If user pauses or resets each PDMA transfer by setting PDMA_PAUSE or PDMA_CHRST register respectively, this bit will be cleared automatically after finishing the current transfer.
 * @var PDMA_T::PRISET
 * Offset: 0x410  PDMA Fixed Priority Setting Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |FPRISETn  |PDMA Fixed Priority Setting
 * |        |          |Set this bit to 1 to enable fixed priority level.
 * |        |          |Write Operation:
 * |        |          |0 = No effect.
 * |        |          |1 = Set PDMA channel [n] to fixed priority channel.
 * |        |          |Read Operation:
 * |        |          |0 = Corresponding PDMA channel is round-robin priority.
 * |        |          |1 = Corresponding PDMA channel is fixed priority.
 * |        |          |Note: This field only set to fixed priority, clear fixed priority use PDMA_PRICLR register.
 * @var PDMA_T::PRICLR
 * Offset: 0x414  PDMA Fixed Priority Clear Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |FPRICLRn  |PDMA Fixed Priority Clear Bits (Write Only)
 * |        |          |Set this bit to 1 to clear fixed priority level.
 * |        |          |0 = No effect.
 * |        |          |1 = Clear PDMA channel [n] fixed priority setting.
 * |        |          |Note: User can read PDMA_PRISET register to know the channel priority.
 * @var PDMA_T::INTEN
 * Offset: 0x418  PDMA Interrupt Enable Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |INTENn    |PDMA Interrupt Enable Bits
 * |        |          |This field is used to enable PDMA channel[n] interrupt.
 * |        |          |0 = PDMA channel n interrupt Disabled.
 * |        |          |1 = PDMA channel n interrupt Enabled.
 * @var PDMA_T::INTSTS
 * Offset: 0x41C  PDMA Interrupt Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |ABTIF     |PDMA Read/Write Target Abort Interrupt Flag (Read Only)
 * |        |          |This bit indicates that PDMA has target abort error; Software can read PDMA_ABTSTS register to find which channel has target abort error.
 * |        |          |0 = No AHB bus ERROR response received.
 * |        |          |1 = AHB bus ERROR response received.
 * |[1]     |TDIF      |Transfer Done Interrupt Flag (Read Only)
 * |        |          |This bit indicates that PDMA controller has finished transmission; User can read PDMA_TDSTS register to indicate which channel finished transfer.
 * |        |          |0 = Not finished yet.
 * |        |          |1 = PDMA channel has finished transmission.
 * |[2]     |ALIGNF    |Transfer Alignment Interrupt Flag (Read Only)
 * |        |          |0 = PDMA channel source address and destination address both follow transfer width setting.
 * |        |          |1 = PDMA channel source address or destination address is not follow transfer width setting.
 * |[8]     |REQTOF0   |Request Time-out Flag for Channel 0
 * |        |          |This flag indicates that PDMA controller has waited peripheral request for a period defined by PDMA_TOC0, user can write 1 to clear these bits.
 * |        |          |0 = No request time-out.
 * |        |          |1 = Peripheral request time-out.
 * |        |          |Note: Please disable time-out function before clear this bit.
 * |[9]     |REQTOF1   |Request Time-out Flag for Channel 1
 * |        |          |This flag indicates that PDMA controller has waited peripheral request for a period defined by PDMA_TOC1, user can write 1 to clear these bits.
 * |        |          |0 = No request time-out.
 * |        |          |1 = Peripheral request time-out.
 * |        |          |Note: Please disable time-out function before clear this bit.
 * @var PDMA_T::ABTSTS
 * Offset: 0x420  PDMA Channel Read/Write Target Abort Flag Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |ABTIFn    |PDMA Read/Write Target Abort Interrupt Status Flag
 * |        |          |This bit indicates which PDMA controller has target abort error; User can write 1 to clear these bits.
 * |        |          |0 = No AHB bus ERROR response received when channel n transfer.
 * |        |          |1 = AHB bus ERROR response received when channel n transfer.
 * @var PDMA_T::TDSTS
 * Offset: 0x424  PDMA Channel Transfer Done Flag Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |TDIFn     |Transfer Done Flag
 * |        |          |This bit indicates whether PDMA controller channel transfer has been finished or not, user can write 1 to clear these bits.
 * |        |          |0 = PDMA channel transfer has not finished.
 * |        |          |1 = PDMA channel has finished transmission.
 * @var PDMA_T::ALIGN
 * Offset: 0x428  PDMA Transfer Alignment Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |ALIGNn    |Transfer Alignment Flag
 * |        |          |This bit indicates whether source and destination address both follow transfer width setting, user can write 1 to clear these bits.
 * |        |          |0 = PDMA channel source address and destination address both follow transfer width setting.
 * |        |          |1 = PDMA channel source address or destination address is not follow transfer width setting.
 * @var PDMA_T::TACTSTS
 * Offset: 0x42C  PDMA Transfer Active Flag Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |TXACTFn   |Transfer on Active Flag (Read Only)
 * |        |          |This bit indicates which PDMA channel is in active.
 * |        |          |0 = PDMA channel is finished.
 * |        |          |1 = PDMA channel is active.
 * @var PDMA_T::TOUTPSC
 * Offset: 0x430  PDMA Time-out Prescaler Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[2:0]   |TOUTPSC0  |PDMA Channel 0 Time-out Clock Source Prescaler Bits
 * |        |          |000 = PDMA channel 0 time-out clock source is HCLK/2^8.
 * |        |          |001 = PDMA channel 0 time-out clock source is HCLK/2^9.
 * |        |          |010 = PDMA channel 0 time-out clock source is HCLK/2^10.
 * |        |          |011 = PDMA channel 0 time-out clock source is HCLK/2^11.
 * |        |          |100 = PDMA channel 0 time-out clock source is HCLK/2^12.
 * |        |          |101 = PDMA channel 0 time-out clock source is HCLK/2^13.
 * |        |          |110 = PDMA channel 0 time-out clock source is HCLK/2^14.
 * |        |          |111 = PDMA channel 0 time-out clock source is HCLK/2^15.
 * |[6:4]   |TOUTPSC1  |PDMA Channel 1 Time-out Clock Source Prescaler Bits
 * |        |          |000 = PDMA channel 1 time-out clock source is HCLK/2^8.
 * |        |          |001 = PDMA channel 1 time-out clock source is HCLK/2^9.
 * |        |          |010 = PDMA channel 1 time-out clock source is HCLK/2^10.
 * |        |          |011 = PDMA channel 1 time-out clock source is HCLK/2^11.
 * |        |          |100 = PDMA channel 1 time-out clock source is HCLK/2^12.
 * |        |          |101 = PDMA channel 1 time-out clock source is HCLK/2^13.
 * |        |          |110 = PDMA channel 1 time-out clock source is HCLK/2^14.
 * |        |          |111 = PDMA channel 1 time-out clock source is HCLK/2^15.
 * @var PDMA_T::TOUTEN
 * Offset: 0x434  PDMA Time-out Enable Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[1:0]   |TOUTENn   |PDMA Time-out Enable Bits
 * |        |          |0 = PDMA Channel n time-out function Disabled.
 * |        |          |1 = PDMA Channel n time-out function Enabled.
 * @var PDMA_T::TOUTIEN
 * Offset: 0x438  PDMA Time-out Interrupt Enable Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[1:0]   |TOUTIENn  |PDMA Time-out Interrupt Enable Bits
 * |        |          |0 = PDMA Channel n time-out interrupt Disabled.
 * |        |          |1 = PDMA Channel n time-out interrupt Enabled.
 * @var PDMA_T::SCATBA
 * Offset: 0x43C  PDMA Scatter-gather Descriptor Table Base Address Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:16] |SCATBA    |PDMA Scatter-gather Descriptor Table Address
 * |        |          |In Scatter-Gather mode, this is the base address for calculating the next link - list address
 * |        |          |The next link address equation is
 * |        |          |Next Link Address = PDMA_SCATBA + PDMA_DSCT_NEXT.
 * |        |          |Note: Only useful in Scatter-Gather mode.
 * @var PDMA_T::TOC0_1
 * Offset: 0x440  PDMA Time-out Counter Ch1 and Ch0 Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |TOC0      |Time-out Counter for Channel 0
 * |        |          |This controls the period of time-out function for channel 0
 * |        |          |The calculation unit is based on TOUTPSC0 (PDMA_TOUTPSC[2:0]) clock
 * |        |          |Time-out period = (Period of time-out clock) * (16-bit TOCn), n = 0,1.
 * |[31:16] |TOC1      |Time-out Counter for Channel 1
 * |        |          |This controls the period of time-out function for channel 1
 * |        |          |The calculation unit is based on TOUTPSC1 (PDMA_TOUTPSC[6:4]) clock
 * |        |          |The example of time-out period can refer TOC0 bit description.
 * @var PDMA_T::CHRST
 * Offset: 0x460  PDMA Channel Reset Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |CHnRST    |Channel n Reset
 * |        |          |0 = corresponding channel n is not reset.
 * |        |          |1 = corresponding channel n is reset.
 * @var PDMA_T::REQSEL0_3
 * Offset: 0x480  PDMA Request Source Select Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[6:0]   |REQSRC0   |Channel 0 Request Source Selection
 * |        |          |This filed defines which peripheral is connected to PDMA channel 0
 * |        |          |User can configure the peripheral by setting REQSRC0.
 * |        |          |0 = Disable PDMA peripheral request.
 * |        |          |1 = Reserved.
 * |        |          |2 = Reserved.
 * |        |          |3 = Reserved .
 * |        |          |4 = Channel connects to UART0_TX.
 * |        |          |5 = Channel connects to UART0_RX.
 * |        |          |6 = Channel connects to UART1_TX.
 * |        |          |7 = Channel connects to UART1_RX.
 * |        |          |8 = Channel connects to UART2_TX.
 * |        |          |9 = Channel connects to UART2_RX.
 * |        |          |10 = Reserved.
 * |        |          |11 = Reserved.
 * |        |          |12 = Reserved.
 * |        |          |13 = Reserved.
 * |        |          |14 = Reserved.
 * |        |          |15 = Reserved.
 * |        |          |16 = Channel connects to USCI0_TX.
 * |        |          |17 = Channel connects to USCI0_RX.
 * |        |          |18 = Channel connects to USCI1_TX.
 * |        |          |19 = Channel connects to USCI1_RX.
 * |        |          |20 = Channel connects to QSPI0_TX.
 * |        |          |21 = Channel connects to QSPI0_RX.
 * |        |          |22 =.
 * |        |          |23 =.
 * |        |          |24 =.
 * |        |          |25 =.
 * |        |          |26 = Channel connects to USCI2_TX.
 * |        |          |27 = Channel connects to USCI2_RX.
 * |        |          |28 = Channel connects to USCI3_TX.
 * |        |          |29 = Channel connects to USCI3_RX.
 * |        |          |30 = Reserved.
 * |        |          |31 = Reserved.
 * |        |          |32 = Channel connects to PWM0_P1_RX.
 * |        |          |33 = Channel connects to PWM0_P2_RX.
 * |        |          |34 = Channel connects to PWM0_P3_RX.
 * |        |          |35 = Channel connects to PWM1_P1_RX.
 * |        |          |36 = Channel connects to PWM1_P2_RX.
 * |        |          |37 = Channel connects to PWM1_P3_RX.
 * |        |          |38 = Channel connects to I2C0_TX.
 * |        |          |39 = Channel connects to I2C0_RX.
 * |        |          |40 =.
 * |        |          |41 =.
 * |        |          |42 = Reserved.
 * |        |          |43 = Reserved.
 * |        |          |44 = Reserved.
 * |        |          |45 = Reserved.
 * |        |          |46 = Channel connects to TMR0.
 * |        |          |47 = Channel connects to TMR1.
 * |        |          |48 = Channel connects to TMR2.
 * |        |          |49 = Channel connects to TMR3.
 * |        |          |50 = Channel connects to ADC_RX.
 * |        |          |51 = Reserved.
 * |        |          |52 = Reserved.
 * |        |          |53 = Reserved.
 * |        |          |54 = Reserved.
 * |        |          |55 = Reserved.
 * |        |          |Others = Reserved.
 * |        |          |Note 1: A peripheral cannot be assigned to two channels at the same time.
 * |        |          |Note 2: This field is useless when transfer between memory and memory. 
 * |[14:8]  |REQSRC1   |Channel 1 Request Source Selection
 * |        |          |This filed defines which peripheral is connected to PDMA channel 1
 * |        |          |User can configure the peripheral setting by REQSRC1.
 * |        |          |Note: The channel configuration is the same as REQSRC0 field
 * |        |          |Please refer to the explanation of REQSRC0.
 * |[22:16] |REQSRC2   |Channel 2 Request Source Selection
 * |        |          |This filed defines which peripheral is connected to PDMA channel 2
 * |        |          |User can configure the peripheral setting by REQSRC2.
 * |        |          |Note: The channel configuration is the same as REQSRC0 field
 * |        |          |Please refer to the explanation of REQSRC0.
 * |[30:24] |REQSRC3   |Channel 3 Request Source Selection
 * |        |          |This filed defines which peripheral is connected to PDMA channel 3
 * |        |          |User can configure the peripheral setting by REQSRC3.
 * |        |          |Note: The channel configuration is the same as REQSRC0 field
 * |        |          |Please refer to the explanation of REQSRC0.
 */
    DSCT_T        DSCT[4];               /*!< [0x0000 ~ 0x003c] Control Register of PDMA Channel 0 ~ 3                  */
    __I  uint32_t RESERVE0[48];
    __I  uint32_t CURSCAT[4];            /*!< [0x0100 ~ 0x010c] Current Scatter-gather Descriptor Table Address of PDMA Channel n */
    __I  uint32_t RESERVE1[188];
    __IO uint32_t CHCTL;                 /*!< [0x0400] PDMA Channel Control Register                                    */
    __O  uint32_t PAUSE;                 /*!< [0x0404] PDMA Transfer Pause Control Register                             */
    __O  uint32_t SWREQ;                 /*!< [0x0408] PDMA Software Request Register                                   */
    __I  uint32_t TRGSTS;                /*!< [0x040c] PDMA Channel Request Status Register                             */
    __IO uint32_t PRISET;                /*!< [0x0410] PDMA Fixed Priority Setting Register                             */
    __O  uint32_t PRICLR;                /*!< [0x0414] PDMA Fixed Priority Clear Register                               */
    __IO uint32_t INTEN;                 /*!< [0x0418] PDMA Interrupt Enable Register                                   */
    __IO uint32_t INTSTS;                /*!< [0x041c] PDMA Interrupt Status Register                                   */
    __IO uint32_t ABTSTS;                /*!< [0x0420] PDMA Channel Read/Write Target Abort Flag Register               */
    __IO uint32_t TDSTS;                 /*!< [0x0424] PDMA Channel Transfer Done Flag Register                         */
    __IO uint32_t ALIGN;                 /*!< [0x0428] PDMA Transfer Alignment Status Register                          */
    __I  uint32_t TACTSTS;               /*!< [0x042c] PDMA Transfer Active Flag Register                               */
    __IO uint32_t TOUTPSC;               /*!< [0x0430] PDMA Time-out Prescaler Register                                 */
    __IO uint32_t TOUTEN;                /*!< [0x0434] PDMA Time-out Enable Register                                    */
    __IO uint32_t TOUTIEN;               /*!< [0x0438] PDMA Time-out Interrupt Enable Register                          */
    __IO uint32_t SCATBA;                /*!< [0x043c] PDMA Scatter-gather Descriptor Table Base Address Register       */
    __IO uint32_t TOC0_1;                /*!< [0x0440] PDMA Time-out Counter Ch1 and Ch0 Register                       */
    __I  uint32_t RESERVE2[7];
    __IO uint32_t CHRST;                 /*!< [0x0460] PDMA Channel Reset Register                                      */
    __I  uint32_t RESERVE3[7];
    __IO uint32_t REQSEL0_3;             /*!< [0x0480] PDMA Request Source Select Register 0                            */

} PDMA_T;

/**
    @addtogroup PDMA_CONST PDMA Bit Field Definition
    Constant Definitions for PDMA Controller
@{ */

